; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	infrared0 - mode
	infrared1 - mode
	image2 - mode
	Star0 - direction
	GroundStation1 - direction
	Star2 - direction
	Planet3 - direction
	Planet4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 infrared0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star0)
	(supports instrument1 infrared1)
	(supports instrument1 image2)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument2 image2)
	(supports instrument2 infrared1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star2)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
	(supports instrument3 image2)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star0)
	(supports instrument4 infrared1)
	(supports instrument4 infrared0)
	(supports instrument4 image2)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation1)
	(supports instrument5 image2)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star2)
	(supports instrument6 infrared1)
	(supports instrument6 infrared0)
	(supports instrument6 image2)
	(calibration_target instrument6 Star2)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet6)
	(supports instrument7 image2)
	(calibration_target instrument7 Star2)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star2)
)
(:goal (and
	(pointing satellite0 Phenomenon13)
	(pointing satellite3 Phenomenon13)
	(have_image Planet3 image2)
	(have_image Planet4 infrared0)
	(have_image Phenomenon5 image2)
	(have_image Planet6 infrared1)
	(have_image Phenomenon7 infrared1)
	(have_image Star8 infrared1)
	(have_image Planet9 image2)
	(have_image Phenomenon10 infrared1)
	(have_image Phenomenon11 infrared0)
	(have_image Phenomenon13 infrared0)
	(have_image Star14 image2)
	(have_image Planet15 image2)
))

)

; plan
1. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 0 of 14
2. (calibrate satellite4 instrument7 star2)
   added: (calibrated instrument7)
   goals met: 0 of 14
3. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 14
4. (calibrate satellite2 instrument4 groundstation1)
   added: (calibrated instrument4)
   goals met: 0 of 14
5. (turn_to satellite4 phenomenon5 star2)
   deleted: (pointing satellite4 star2)
   added: (pointing satellite4 phenomenon5)
   goals met: 0 of 14
6. (take_image satellite4 phenomenon5 instrument7 image2)
   added: (have_image phenomenon5 image2)
   goals met: 1 of 14
7. (turn_to satellite4 planet15 phenomenon5)
   deleted: (pointing satellite4 phenomenon5)
   added: (pointing satellite4 planet15)
   goals met: 1 of 14
8. (take_image satellite4 planet15 instrument7 image2)
   added: (have_image planet15 image2)
   goals met: 2 of 14
9. (turn_to satellite4 planet3 planet15)
   deleted: (pointing satellite4 planet15)
   added: (pointing satellite4 planet3)
   goals met: 2 of 14
10. (take_image satellite4 planet3 instrument7 image2)
   added: (have_image planet3 image2)
   goals met: 3 of 14
11. (turn_to satellite4 planet9 planet3)
   deleted: (pointing satellite4 planet3)
   added: (pointing satellite4 planet9)
   goals met: 3 of 14
12. (take_image satellite4 planet9 instrument7 image2)
   added: (have_image planet9 image2)
   goals met: 4 of 14
13. (turn_to satellite4 star14 planet9)
   deleted: (pointing satellite4 planet9)
   added: (pointing satellite4 star14)
   goals met: 4 of 14
14. (take_image satellite4 star14 instrument7 image2)
   added: (have_image star14 image2)
   goals met: 5 of 14
15. (turn_to satellite3 phenomenon13 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 phenomenon13)
   goals met: 6 of 14
16. (turn_to satellite2 phenomenon10 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon10)
   goals met: 6 of 14
17. (take_image satellite2 phenomenon10 instrument4 infrared1)
   added: (have_image phenomenon10 infrared1)
   goals met: 7 of 14
18. (turn_to satellite2 phenomenon11 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 phenomenon11)
   goals met: 7 of 14
19. (take_image satellite2 phenomenon11 instrument4 infrared0)
   added: (have_image phenomenon11 infrared0)
   goals met: 8 of 14
20. (turn_to satellite2 phenomenon13 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 phenomenon13)
   goals met: 8 of 14
21. (take_image satellite2 phenomenon13 instrument4 infrared0)
   added: (have_image phenomenon13 infrared0)
   goals met: 9 of 14
22. (turn_to satellite2 phenomenon7 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon7)
   goals met: 9 of 14
23. (take_image satellite2 phenomenon7 instrument4 infrared1)
   added: (have_image phenomenon7 infrared1)
   goals met: 10 of 14
24. (turn_to satellite2 planet4 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 planet4)
   goals met: 10 of 14
25. (take_image satellite2 planet4 instrument4 infrared0)
   added: (have_image planet4 infrared0)
   goals met: 11 of 14
26. (turn_to satellite2 planet6 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 planet6)
   goals met: 11 of 14
27. (take_image satellite2 planet6 instrument4 infrared1)
   added: (have_image planet6 infrared1)
   goals met: 12 of 14
28. (turn_to satellite2 star8 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 star8)
   goals met: 12 of 14
29. (take_image satellite2 star8 instrument4 infrared1)
   added: (have_image star8 infrared1)
   goals met: 13 of 14
30. (turn_to satellite0 phenomenon13 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 phenomenon13)
   goals met: 14 of 14
